package lessons.lesson20240603seminar;
/*
Цель
Разработать класс RubberArray, который будет улучшенной версией обычного массива.

Требования на первый спринт
Хранилище данных

Использовать массив для хранения элементов.
Операции

Добавление элемента

Метод append: добавляет элемент в конец массива.
Добавление нескольких элементов

Метод appendRange: добавляет несколько элементов в конец массива.
Удаление элемента

Метод remove: удаляет первый найденный элемент из массива.
Удаление элемента по указанному индексу

Метод removeAt(int position): удаляет элемент из массива на указанной позиции.
Чтение элемента по индексу

Метод get: возвращает элемент по указанному индексу.
Размер массива

Метод size: возвращает текущий размер массива.
Проверка наличия элемента

Метод contains: проверяет, содержится ли элемент в массиве.
Внутренние методы и структуры

Внутренний массив должен автоматически увеличиваться при необходимости (увеличение вместимости).
 */
public class RubberArray {
}
